; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image1 - mode
	image0 - mode
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star4)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star4)
	(supports instrument4 image0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
)
(:goal (and
	(pointing satellite1 Phenomenon11)
	(have_image Phenomenon5 image1)
	(have_image Phenomenon6 image1)
	(have_image Planet7 image1)
	(have_image Planet8 image0)
	(have_image Phenomenon9 image1)
	(have_image Planet10 image0)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image1)
	(have_image Star13 image0)
	(have_image Planet14 image0)
))

)

; plan
1. (turn_to satellite1 star4 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star4)
   goals met: 0 of 11
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite1 phenomenon9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 11
5. (take_image satellite1 phenomenon9 instrument1 image1)
   added: (have_image phenomenon9 image1)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 11
7. (take_image satellite1 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   goals met: 2 of 11
8. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 11
9. (take_image satellite1 phenomenon5 instrument1 image1)
   added: (have_image phenomenon5 image1)
   goals met: 3 of 11
10. (turn_to satellite1 phenomenon12 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 11
11. (take_image satellite1 phenomenon12 instrument1 image1)
   added: (have_image phenomenon12 image1)
   goals met: 4 of 11
12. (turn_to satellite1 planet10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet10)
   goals met: 4 of 11
13. (take_image satellite1 planet10 instrument1 image0)
   added: (have_image planet10 image0)
   goals met: 5 of 11
14. (turn_to satellite1 planet14 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet14)
   goals met: 5 of 11
15. (take_image satellite1 planet14 instrument1 image0)
   added: (have_image planet14 image0)
   goals met: 6 of 11
16. (turn_to satellite1 planet7 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet7)
   goals met: 6 of 11
17. (take_image satellite1 planet7 instrument1 image1)
   added: (have_image planet7 image1)
   goals met: 7 of 11
18. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 7 of 11
19. (take_image satellite1 planet8 instrument1 image0)
   added: (have_image planet8 image0)
   goals met: 8 of 11
20. (turn_to satellite1 star13 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star13)
   goals met: 8 of 11
21. (take_image satellite1 star13 instrument1 image0)
   added: (have_image star13 image0)
   goals met: 9 of 11
22. (turn_to satellite1 phenomenon11 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 phenomenon11)
   goals met: 10 of 11
23. (take_image satellite1 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 11 of 11
